In [1]:
# Connecting to MicrosoftSql Server
import pandas as pd
import pyodbc
sql_conn = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};SERVER=TOLUWANIMI\TOLUSQLSERVER; DATABASE=AdventureWorksDW2017; Trusted_Connection=yes')

In [ ]:
# Importing from database in sql
query = "SELECT * FROM DimCustomer;"
my_data = pd.read_sql(query, sql_conn)
my_data.head()

In [3]:
my_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18484 entries, 0 to 18483
Data columns (total 29 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerKey           18484 non-null  int64
 1   GeographyKey          18484 non-null  int64
 2   CustomerAlternateKey  18484 non-null  object
 3   Title                 101 non-null    object
 4   FirstName             18484 non-null  object
 5   MiddleName            10654 non-null  object
 6   LastName              18484 non-null  object
 7   NameStyle             18484 non-null  bool
 8   BirthDate             18484 non-null  object
 9   MaritalStatus         18484 non-null  object
 10  Suffix                3 non-null      object
 11  Gender                18484 non-null  object
 12  EmailAddress          18484 non-null  object
 13  YearlyIncome          18484 non-null  float64
 14  TotalChildren         18484 non-null  int64
 15  NumberChildrenAtHome  18484 non-null  int64
 16  EnglishEducation      18484 non-null  object
 17  SpanishEducation      18484 non-null  object
 18  FrenchEducation       18484 non-null  object
 19  EnglishOccupation     18484 non-null  object
 20  SpanishOccupation     18484 non-null  object
 21  FrenchOccupation      18484 non-null  object
 22  HouseOwnerFlag        18484 non-null  object
 23  NumberCarsOwned       18484 non-null  int64
 24  AddressLine1          18484 non-null  object
 25  AddressLine2          312 non-null    object
 26  Phone                 18484 non-null  object
 27  DateFirstPurchase     18484 non-null  object
 28  CommuteDistance       18484 non-null  object
dtypes: bool(1), float64(1), int64(5), object(22)
memory usage: 4.0+ MB

In [ ]:
# count for unique in variables
print(my_data.nunique())

In [6]:
# print distinct values in particular column %%
print(my_data['MaritalStatus'].value_counts())

M    10011
S     8473
Name: MaritalStatus, dtype: int64

In [11]:
# describing a particular non string varible
my_data['YearlyIncome'].describe()

count     18484.000000
mean      64005.431725
std       35713.927735
min       11000.000000
25%       33000.000000
50%       66000.000000
75%       79200.000000
max      211200.000000
Name: YearlyIncome, dtype: float64

In [13]:
#filtering Variables
my_data2 = my_data[['MaritalStatus','YearlyIncome','NumberChildrenAtHome']]
my_data2.head()

  MaritalStatus  YearlyIncome  NumberChildrenAtHome
0             M       99000.0                     0
1             S       66000.0                     3
2             M       66000.0                     3
3             S       77000.0                     0
4             S       88000.0                     5